In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import statistics as st
import seaborn as sns

In [3]:
df = pd.read_csv("raw_dataset.csv")

In [4]:
print(df)

       id           name                     email      phone_number  age  \
0     146    Peter Smith      peter.smith@mail.net  '+1 576 183 7154   22
1     212    Peter Jones      peter.jones@mail.net  '+1 221 925 1745   30
2     795   Emily Miller  emily.miller@example.com    (693) 341-6412   19
3     574     Mary Davis    mary.davis@example.com    (325) 645-1496   60
4     617    Peter Brown   peter.brown@example.com    (214) 571-8988   58
...   ...            ...                       ...               ...  ...
1045  780    Mary Wilson      mary.wilson@mail.net        6748410133  200
1046  965     John Davis    john.davis@example.com        9561337087   38
1047  511       John Doe         john.doe@mail.net  '+1 937 923 8814   19
1048  610  Michael Jones    michael.jones@test.org        8827554848   49
1049  660      Sarah Doe     sarah.doe@example.com      040-555-6966   40

      gender         city   country registration_date        last_login  \
0      OTHER    San Diego   Germany        14-10-2021  13-05-2022 10:33
1     Female    San Diego     India        11-04-2021  05-12-2023 17:39
2      Other  Los Angeles    Canada        28-12-2022  12-06-2025 06:30
3       Male    San Diego    Mexico        03/27/2021               NaN
4       Male      Phoenix    France        31-01-2024  06/22/2025 22:38
...      ...          ...       ...               ...               ...
1045   Other      Phoenix        UK        02/16/2021  11/26/2021 07:25
1046    Male      Houston     India        10/17/2023  01/29/2024 11:05
1047   Other      Phoenix   Mexicox        08-03-2023  02-11-2023 14:38
1048   other      Chicago  Atlantis        22-11-2022  09/21/2024 21:43
1049   Other      Houston   Germany        21-07-2023  02-12-2025 11:07

      purchase_amount product_category  feedback_score
0              582.04             Food               1
1              721.30             Food               1
2              998.73         Clothing               2
3              449.73             Food               3
4              690.56         Clothing               2
...               ...              ...             ...
1045              NaN             Food               4
1046           889.12         Clothing               1
1047           505.21             Food               5
1048           508.03             Food               2
1049           736.31           Sports               4

[1050 rows x 13 columns]

In [5]:
df.head()

,id,name,email,phone_number,age,gender,city,country,registration_date,last_login,purchase_amount,product_category,feedback_score
0,146,Peter Smith,peter.smith@mail.net,'+1 576 183 7154,22,OTHER,San Diego,Germany,14-10-2021,13-05-2022 10:33,582.04,Food,1
1,212,Peter Jones,peter.jones@mail.net,'+1 221 925 1745,30,Female,San Diego,India,11-04-2021,05-12-2023 17:39,721.30,Food,1
2,795,Emily Miller,emily.miller@example.com,(693) 341-6412,19,Other,Los Angeles,Canada,28-12-2022,12-06-2025 06:30,998.73,Clothing,2
3,574,Mary Davis,mary.davis@example.com,(325) 645-1496,60,Male,San Diego,Mexico,03/27/2021,NaN,449.73,Food,3
4,617,Peter Brown,peter.brown@example.com,(214) 571-8988,58,Male,Phoenix,France,31-01-2024,06/22/2025 22:38,690.56,Clothing,2

In [6]:
df.shape

(1050, 13)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 1050 non-null   int64
 1   name               1050 non-null   object
 2   email              1005 non-null   object
 3   phone_number       980 non-null    object
 4   age                1004 non-null   object
 5   gender             1050 non-null   object
 6   city               988 non-null    object
 7   country            1050 non-null   object
 8   registration_date  1050 non-null   object
 9   last_login         989 non-null    object
 10  purchase_amount    1009 non-null   float64
 11  product_category   1050 non-null   object
 12  feedback_score     1050 non-null   int64
dtypes: float64(1), int64(2), object(10)
memory usage: 106.8+ KB

In [8]:
df.isnull().sum()

id                    0
name                  0
email                45
phone_number         70
age                  46
gender                0
city                 62
country               0
registration_date     0
last_login           61
purchase_amount      41
product_category      0
feedback_score        0
dtype: int64

In [9]:
df = df.drop_duplicates()

In [10]:
df = df.dropna()

In [22]:
df = df.fillna(0)

In [11]:
df.fillna(df.mean(numeric_only=True), inplace=True)

In [12]:
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")